andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/helpers/internal/nrfx_gppiv1_ipct.c
/* Set of macros to allow calculation of array index where given index is located.
 * We create a structure with fields for each instance which has non-zero
 * CHANNEL_MASK. Then offsetof is used to get the index of the given instance.
 */
#define _IPCT_STRUCT_ELEM(periph_name, prefix, inst_num, _) \
    NRFX_COND_CODE_1(NRFX_IS_EMPTY(inst_num), (), \
            (NRFX_COND_CODE_1(NRFX_IPCT_OWNED_MASK(inst_num), \
                              (uint8_t NRFX_CONCAT(dummy, inst_num);), ())))

#define IPCT_IDX_STRUCT() \
    struct ipct_idx_dummy_struct { \
        NRFX_FOREACH_PRESENT(IPCT, _IPCT_STRUCT_ELEM, (), (), _) \
    }

#define IPCT_IDX(inst_num) \
    NRFX_COND_CODE_1(NRFX_IPCT_OWNED_MASK(inst_num), \
            (offsetof(struct ipct_idx_dummy_struct, NRFX_CONCAT(dummy, inst_num))), \
            (-1))

IPCT_IDX_STRUCT();

static const int ipct_main_idx = IPCT_IDX(NRFX_INTERCONNECT_MAIN_IPCT_INSTANCE);

static interconnect_ipct_t const * interconnect_ipct_main_get(void)
{
    return ipct_main_idx >= 0 ? &m_global_ipct_interconnect[ipct_main_idx] : NULL;
}

static interconnect_ipct_t const * interconnect_ipct_get(interconnect_apb_t const * p_apb_prop)
{
    uint8_t bus = nrf_address_bus_get((uint32_t)p_apb_prop->p_dppi, p_apb_prop->size);

    if (interconnect_apb_domain_get(p_apb_prop) == NRF_DOMAIN_GLOBAL)
    {
        for (uint8_t i = 0; i < NRFX_ARRAY_SIZE(m_global_ipct_interconnect); i++)
        {
            // Check if some IPCT is on the same bus
            if (nrf_address_bus_get((uint32_t)m_global_ipct_interconnect[i].p_ipct, p_apb_prop->size) == bus)
            {
                return &m_global_ipct_interconnect[i];
            }
        }
        // The power domain connected to `bus` doesn't contain its own IPCT peripheral
        for (uint8_t i = 0; i < interconnect_apb_global_num_of_get(); i++)
        {
            // Check whether it is possible to connect via DPPI
            if (nrf_apb_interconnect_by_idx_global_get(i)->p_dppi == p_apb_prop->p_dppi)
            {
                return interconnect_ipct_main_get();
            }
        }
    }
    else
    {
        return &m_local_ipct_interconnect[0];
    }
    return NULL;
}

#define CHANNEL_INVALID UINT8_MAX

#define NUMBER_OF_VIRTUAL_CHANNELS NRFX_GPPI_PROG_APP_CHANNELS_NUM
#define VIRTUAL_CHANNELS_MASK      NRFX_GPPI_PROG_APP_CHANNELS_MASK

typedef struct
{
    interconnect_apb_t const * p_src_apb;
    interconnect_apb_t const * p_dst_apb;
    uint8_t                         dppi_channel;
    uint8_t                         local_dppi_channel;
    uint8_t                         ipct_channel;
    uint8_t                         local_ipct_channel;
} nrfx_gppi_channels_path_t;

static nrfx_gppi_channels_path_t channels_path[NUMBER_OF_VIRTUAL_CHANNELS];
static nrfx_atomic_t m_virtual_channels = VIRTUAL_CHANNELS_MASK;

static void path_cleanup(nrfx_gppi_channels_path_t * p_path)
{
    NRFX_ASSERT(p_path);
    memset(p_path, 0, sizeof(nrfx_gppi_channels_path_t));
    p_path->dppi_channel = CHANNEL_INVALID;
    p_path->local_dppi_channel = CHANNEL_INVALID;
    p_path->ipct_channel = CHANNEL_INVALID;
}

static int channel_free(nrfx_atomic_t * p_allocated_channels, uint8_t channel)
{
    NRFX_ASSERT(p_allocated_channels);
    if (channel == CHANNEL_INVALID)
    {
        return -EINVAL;
    }
    return nrfx_flag32_free(p_allocated_channels, channel);
}

static int channel_allocate(nrfx_atomic_t * p_channels_available,
                            uint8_t       * p_channel,
                            uint32_t        mask)
{
    NRFX_ASSERT(p_channel);
    uint32_t chan_avail;
    uint32_t chan_avail_masked;
    uint8_t chan_to_alloc;
    uint32_t prev_mask;

    do {
        chan_avail = *p_channels_available;
        chan_avail_masked = chan_avail & mask;
        if (chan_avail_masked == 0)
        {
            return -ENOMEM;
        }
        else
        {
            chan_to_alloc = (uint8_t)(31UL - NRF_CLZ(chan_avail_masked));
        }

        prev_mask = NRFX_ATOMIC_FETCH_AND(p_channels_available,
                                          ~NRFX_BIT(chan_to_alloc));
    } while (prev_mask == *p_channels_available);
    *p_channel = chan_to_alloc;
    return 0;
}

/* The main connection is needed when connecting two APBs from Global Domain.
   In addition no of them is main APB. In case of nRF54H20 microcontroller the main APB is APB32. */
static bool is_main_connection_needed(interconnect_apb_t const * p_src_apb,
                                      interconnect_apb_t const * p_dst_apb)
{
    if (interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN_GLOBAL ||
        interconnect_apb_domain_get(p_dst_apb) == NRF_DOMAIN_GLOBAL)
    {
        return (p_src_apb != interconnect_apb_main_get() &&
                p_dst_apb != interconnect_apb_main_get() &&
                p_src_apb != p_dst_apb);
    }
    return false;
}

/* This function removes the direct connection between two APBs via PPIB bridge. */
static void apb_connection_remove(interconnect_apb_t const * p_src_apb,
                                  interconnect_apb_t const * p_dst_apb,
                                  uint8_t                         ppib_channel)
{
    NRFX_ASSERT((p_src_apb != p_dst_apb) && p_src_apb && p_dst_apb &&
                (interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN) &&
                (interconnect_apb_domain_get(p_src_apb) == interconnect_apb_domain_get(p_dst_apb)));
    // Inside local domain PPIB connection should be cleared here.
    nrf_ppib_subscribe_clear(p_src_apb->p_ppib,
                             nrf_ppib_send_task_get(ppib_channel));
    nrf_ppib_publish_clear(p_dst_apb->p_ppib,
                           nrf_ppib_receive_event_get(ppib_channel));
}

/* This function connects directly two APBs via PPIB bridge. */
static void apb_connection_create(interconnect_apb_t const * p_src_apb,
                                  interconnect_apb_t const * p_dst_apb,
                                  uint8_t                         ppib_channel)
{
    NRFX_ASSERT((p_src_apb != p_dst_apb) && p_src_apb && p_dst_apb &&
                (interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN) &&
                (interconnect_apb_domain_get(p_src_apb) == interconnect_apb_domain_get(p_dst_apb)));
    // Inside local domain PPIB connection should be set here.
    nrf_ppib_subscribe_set(p_src_apb->p_ppib,
                           nrf_ppib_send_task_get(ppib_channel),
                           ppib_channel);
    nrf_ppib_publish_set(p_dst_apb->p_ppib,
                         nrf_ppib_receive_event_get(ppib_channel),
                         ppib_channel);
}

