andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/helpers/internal/nrfx_gppiv1_ipct.c
/* This function removes direct connection between two domains via IPCT.
   It must be called before all local connections are removed
   (Before all `local_connection_remove()` function calls). */
static int ipct_connection_remove(interconnect_ipct_t const * p_src_ipct,
                                  interconnect_ipct_t const * p_dst_ipct,
                                  nrfx_gppi_channels_path_t      * p_path)
{
    NRFX_ASSERT(p_src_ipct && p_dst_ipct && (p_dst_ipct != p_src_ipct) && p_path &&
                (interconnect_ipct_domain_get(p_src_ipct) == NRF_DOMAIN_GLOBAL ||
                 interconnect_ipct_domain_get(p_dst_ipct) == NRF_DOMAIN_GLOBAL));

    int err_code;
    uint8_t src_ipct_chan = interconnect_ipct_domain_get(p_src_ipct) == NRF_DOMAIN_GLOBAL ?
                            p_path->ipct_channel :
                            p_path->local_ipct_channel;
    uint8_t dst_ipct_chan = interconnect_ipct_domain_get(p_dst_ipct) == NRF_DOMAIN_GLOBAL ?
                            p_path->ipct_channel :
                            p_path->local_ipct_channel;

    err_code = channel_free(p_src_ipct->p_ipct_channels, src_ipct_chan);
    if (err_code == 0)
    {
        /* Source channel is either already freed or it is not permitted by the configuration. */
        err_code = channel_free(p_dst_ipct->p_ipct_channels, dst_ipct_chan);
        if (err_code == 0)
        {
            /* Clearing both IPCT configurations. */
            nrf_ipct_shorts_disable(p_src_ipct->p_ipct, NRFX_BIT(src_ipct_chan));
            nrf_ipct_shorts_disable(p_dst_ipct->p_ipct, NRFX_BIT(dst_ipct_chan));
            nrf_ipct_subscribe_clear(p_src_ipct->p_ipct, nrf_ipct_send_task_get(src_ipct_chan));
            nrf_ipct_publish_clear(p_dst_ipct->p_ipct, nrf_ipct_receive_event_get(dst_ipct_chan));
        }
    }
    return err_code;
}

/* Enable or disable all channels for all involved DPPIC peripherals. */
static void dppic_channel_set(uint8_t chan, bool enable)
{
    nrfx_gppi_channels_path_t * p_path = &channels_path[chan];
    interconnect_apb_t const * p_src_apb = p_path->p_src_apb;
    interconnect_apb_t const * p_dst_apb = p_path->p_dst_apb;
    uint8_t src_dppi_chan = interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN_GLOBAL ?
                            p_path->dppi_channel :
                            p_path->local_dppi_channel;
    uint8_t dst_dppi_chan = interconnect_apb_domain_get(p_dst_apb) == NRF_DOMAIN_GLOBAL ?
                            p_path->dppi_channel :
                            p_path->local_dppi_channel;

    NRFX_ASSERT(nrfx_flag32_is_allocated(m_virtual_channels, chan) && p_src_apb && p_dst_apb);
    nrfy_dppi_channels_set(p_src_apb->p_dppi, NRFX_BIT(src_dppi_chan), enable);
    nrfy_dppi_channels_set(p_dst_apb->p_dppi, NRFX_BIT(dst_dppi_chan), enable);
    if (is_main_connection_needed(p_src_apb, p_dst_apb))
    {
        nrfy_dppi_channels_set(interconnect_apb_main_get()->p_dppi,
                               NRFX_BIT(p_path->dppi_channel),
                               enable);
    }
    if (interconnect_apb_domain_get(p_src_apb) != interconnect_apb_domain_get(p_dst_apb))
    {
        // Remove also DPPICn channels related with IPCT peripherals if needed.
        interconnect_ipct_t const * p_src_ipct = interconnect_ipct_get(p_src_apb);
        interconnect_ipct_t const * p_dst_ipct = interconnect_ipct_get(p_dst_apb);
        interconnect_apb_t const * p_src_ipct_apb =
                                        (interconnect_apb_get((uint32_t)p_src_ipct->p_ipct));
        interconnect_apb_t const * p_dst_ipct_apb =
                                        (interconnect_apb_get((uint32_t)p_dst_ipct->p_ipct));

        NRFX_ASSERT(p_src_ipct && p_src_ipct_apb &&
                    p_dst_ipct && p_dst_ipct_apb);
        nrfy_dppi_channels_set(p_src_ipct_apb->p_dppi,
                               NRFX_BIT(src_dppi_chan),
                               enable);
        nrfy_dppi_channels_set(p_dst_ipct_apb->p_dppi,
                               NRFX_BIT(dst_dppi_chan),
                               enable);
    }
}

/* This function creates direct connection between two domains via IPCT.
   It must be called after all local connections are created
   (After all `local_connection_create()` function calls). */
static int ipct_connection_create(interconnect_ipct_t const * p_src_ipct,
                                  interconnect_ipct_t const * p_dst_ipct,
                                  nrfx_gppi_channels_path_t      * p_path)
{
    NRFX_ASSERT(p_src_ipct && p_dst_ipct && (p_dst_ipct != p_src_ipct) && p_path &&
                (interconnect_ipct_domain_get(p_src_ipct) == NRF_DOMAIN_GLOBAL ||
                 interconnect_ipct_domain_get(p_dst_ipct) == NRF_DOMAIN_GLOBAL));

    int err_code;
    uint8_t src_dppi_channel;
    uint8_t dst_dppi_channel;
    uint8_t * src_ipct_channel;
    uint8_t * dst_ipct_channel;
    uint32_t src_chan_mask;
    uint32_t dst_chan_mask;
    interconnect_apb_t const * p_src_apb =
                                    interconnect_apb_get((uint32_t)p_src_ipct->p_ipct);
    interconnect_apb_t const * p_dst_apb =
                                    interconnect_apb_get((uint32_t)p_dst_ipct->p_ipct);

    if (interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN_GLOBAL)
    {
        /* Connetion from Global Domain (src) to Local Domain (dst). */
        src_dppi_channel = p_path->dppi_channel;
        src_ipct_channel = &p_path->ipct_channel;
        dst_dppi_channel = p_path->local_dppi_channel;
        dst_ipct_channel = &p_path->local_ipct_channel;
    }
    else if (interconnect_apb_domain_get(p_dst_apb) == NRF_DOMAIN_GLOBAL)
    {
        /* Connetion from Local Domain (src) to Global Domain (dst). */
        src_dppi_channel = p_path->local_dppi_channel;
        src_ipct_channel = &p_path->local_ipct_channel;
        dst_dppi_channel = p_path->dppi_channel;
        dst_ipct_channel = &p_path->ipct_channel;
    }
    else
    {
        return -EINVAL;
    }

