andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/helpers/internal/nrfx_gppiv1_ipct.c
    src_chan_mask = *p_src_ipct->p_ipct_channels & p_src_ipct->ipct_pub_channels_mask;
    dst_chan_mask = *p_dst_ipct->p_ipct_channels & p_dst_ipct->ipct_sub_channels_mask;
    err_code = channel_allocate(p_src_ipct->p_ipct_channels, src_ipct_channel, src_chan_mask);
    if (err_code == 0)
    {
        /* No more IPCT channels available for source domain. */
        err_code = channel_allocate(p_dst_ipct->p_ipct_channels, dst_ipct_channel, dst_chan_mask);
        if (err_code == 0)
        {
            /* Setting up both IPCT configurations. */
            nrf_ipct_shorts_enable(p_src_ipct->p_ipct, NRFX_BIT(*src_ipct_channel));
            nrf_ipct_shorts_enable(p_dst_ipct->p_ipct, NRFX_BIT(*dst_ipct_channel));
            nrf_ipct_subscribe_set(p_src_ipct->p_ipct,
                                   nrf_ipct_send_task_get(*src_ipct_channel),
                                   src_dppi_channel);
            nrf_ipct_publish_set(p_dst_ipct->p_ipct,
                                 nrf_ipct_receive_event_get(*dst_ipct_channel),
                                 dst_dppi_channel);
        }
        else
        {
            /* No more IPCT channels available for destination domain.
               Then We can free previously allocated channel for source domain. */
            (void)channel_free(p_src_ipct->p_ipct_channels, *src_ipct_channel);
        }
    }
    return err_code;
}

/* This function creates connection between two APBs inside one domain via DPPIC
   (and PPIB if needed).
   It must be called before IPCT connection is created
   (Before `ipct_connection_create()` function call). */
static int local_connection_create(interconnect_apb_t const * p_src_apb,
                                   interconnect_apb_t const * p_dst_apb,
                                   uint8_t *                       dppi_channel)
{
    int err_code;
    uint8_t reserved_src_channel = CHANNEL_INVALID;
    uint8_t reserved_dst_channel = CHANNEL_INVALID;
    bool use_main_apb_interconnect = false;
    uint32_t chan_mask;
    uint32_t chan_mask_to_exclude = UINT32_MAX;

    NRFX_ASSERT(p_src_apb && p_dst_apb);

    NRFX_CRITICAL_SECTION_ENTER();
    if (p_src_apb == p_dst_apb)
    {
        chan_mask_to_exclude = p_src_apb->dppi_pub_channels_mask |
                               p_src_apb->dppi_sub_channels_mask;
        /* Creating connection whithin one APB. No need to have publish/subscribe mask then.*/
        chan_mask = *p_src_apb->p_dppi_channels;
        if (chan_mask & ~chan_mask_to_exclude)
        {
            /* Try not to utilize channels that can be connected to other APBs. */
            chan_mask &= ~chan_mask_to_exclude;
        }
        err_code = channel_allocate(p_src_apb->p_dppi_channels, dppi_channel, chan_mask);
    }
    else
    {
        /* Creating connection between two different APBs. */
        chan_mask = (*p_src_apb->p_dppi_channels & p_src_apb->dppi_pub_channels_mask) &
                    (*p_dst_apb->p_dppi_channels & p_dst_apb->dppi_sub_channels_mask);
        if (is_main_connection_needed(p_src_apb, p_dst_apb))
        {
            /* The path requires to go through the main APB. */
            use_main_apb_interconnect = true;
            chan_mask &= (interconnect_apb_main_get()->dppi_pub_channels_mask &
                          interconnect_apb_main_get()->dppi_sub_channels_mask &
                          (uint32_t)(*interconnect_apb_main_get()->p_dppi_channels));
        }
        else if (p_src_apb == interconnect_apb_main_get())
        {
            /* The path does not go through the main APB,
               however the source endpoint belongs to it. */
            chan_mask_to_exclude = p_src_apb->dppi_sub_channels_mask;

        }
        else if (p_dst_apb == interconnect_apb_main_get())
        {
            /* The path does not go through the main APB,
               however the destination endpoint belongs to it. */
            chan_mask_to_exclude = p_dst_apb->dppi_pub_channels_mask;
        }
        if (chan_mask & ~chan_mask_to_exclude)
        {
            /* Try not to utilize channels that can be used for broader connections. */
            chan_mask &= ~chan_mask_to_exclude;
        }

        /* Allocating same channel for all involved DPPICs. */
        err_code = channel_allocate(p_src_apb->p_dppi_channels, dppi_channel, chan_mask);
        if (err_code == 0)
        {
            reserved_src_channel = *dppi_channel;
            err_code = channel_allocate(p_dst_apb->p_dppi_channels, dppi_channel, chan_mask);
            if (err_code == 0)
            {
                reserved_dst_channel = *dppi_channel;
                if (use_main_apb_interconnect)
                {
                    *dppi_channel = CHANNEL_INVALID;
                    err_code = channel_allocate(
                                    interconnect_apb_main_get()->p_dppi_channels,
                                    dppi_channel,
                                    chan_mask);
                }
            }
        }

        if (err_code != 0)
        {
            /* For at least one of involved DPPICs there was no channels available. */
            (void)channel_free(p_src_apb->p_dppi_channels, reserved_src_channel);
            (void)channel_free(p_dst_apb->p_dppi_channels, reserved_dst_channel);
            (void)channel_free(interconnect_apb_main_get()->p_dppi_channels, *dppi_channel);
        }
        else if (interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN)
        {
            /* Inside our domain we are allowed to configure APB connection by ourself.
               (For Global Domain it is done by Secure Deomain). */
            apb_connection_create(p_src_apb, p_dst_apb, *dppi_channel);
        }
    }
    NRFX_CRITICAL_SECTION_EXIT();
    return err_code;
}

/* This function removes connection between two APBs inside one domain.
   It must be called after IPCT connection is removed
   (After `ipct_connection_remove()` function call). */
static int local_connection_remove(interconnect_apb_t const * p_src_apb,
                                   interconnect_apb_t const * p_dst_apb,
                                   uint8_t                    dppi_channel)
{
    int err_code;

    NRFX_ASSERT((dppi_channel != CHANNEL_INVALID) && p_src_apb && p_dst_apb &&
                (interconnect_apb_domain_get(p_src_apb) == interconnect_apb_domain_get(p_dst_apb)));
    if (p_src_apb == p_dst_apb)
    {
        /* Removing connection within one APB. */
        err_code = channel_free(p_src_apb->p_dppi_channels, dppi_channel);
        if (err_code != 0)
        {
            return err_code;
        }
    }
    else
    {
        /* Removing connection between two APBs. */
        NRFX_CRITICAL_SECTION_ENTER();
        err_code = channel_free(p_src_apb->p_dppi_channels, dppi_channel);
        if (err_code == 0)
        {
            err_code = channel_free(p_dst_apb->p_dppi_channels, dppi_channel);
            if (err_code == 0)
            {
                if (is_main_connection_needed(p_src_apb, p_dst_apb))
                {
                    /* The path required to go through the main APB*/
                    err_code = channel_free(interconnect_apb_main_get()->p_dppi_channels,
                                            dppi_channel);
                }
            }
        }
        NRFX_CRITICAL_SECTION_EXIT();
    }

