andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/helpers/internal/nrfx_gppiv1_ipct.c
    if (err_code != 0)
    {
        return err_code;
    }
    if (interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN && p_src_apb != p_dst_apb)
    {
        /* Inside our domain we are allowed to configure APB connection by ourself. */
        apb_connection_remove(p_src_apb, p_dst_apb, dppi_channel);
    }
    return err_code;
}

int nrfx_gppiv1_channel_alloc(uint8_t * p_channel)
{
    int ch;
    nrfx_gppi_channels_path_t * chan;

    ch = nrfx_flag32_alloc(&m_virtual_channels);
    if (ch < 0)
    {
        return ch;
    }

    *p_channel = (uint8_t)ch;
    chan = &channels_path[*p_channel];
    path_cleanup(chan);
    return 0;
}

void nrfx_gppiv1_event_endpoint_setup(uint8_t channel, uint32_t eep)
{
    (void)channel;
    (void)eep;
    // `tep` is also needed to decide whether `main_apb` is to be used.
    NRFX_ASSERT(false);
}

void nrfx_gppiv1_task_endpoint_setup(uint8_t channel, uint32_t tep)
{
    (void)channel;
    (void)tep;
    // `eep` is also needed to decide whether `main_apb` is to be used.
    NRFX_ASSERT(false);
}

void nrfx_gppiv1_event_endpoint_clear(uint8_t channel, uint32_t eep)
{
    (void)channel;
    (void)eep;
    // `tep` is also needed to decide whether `main_apb` is to be used.
    NRFX_ASSERT(false);
}

void nrfx_gppiv1_task_endpoint_clear(uint8_t channel, uint32_t tep)
{
    (void)channel;
    (void)tep;
    // `eep` is also needed to decide whether `main_apb` is to be used.
    NRFX_ASSERT(false);
}

void nrfx_gppiv1_fork_endpoint_setup(uint8_t channel, uint32_t fork_tep)
{
    NRFX_ASSERT(fork_tep && nrfx_flag32_is_allocated(m_virtual_channels, channel));
    interconnect_apb_t const * p_apb = interconnect_apb_get(fork_tep);
    nrfx_gppi_channels_path_t * p_path = &channels_path[channel];
    uint8_t dppi_chan = interconnect_apb_domain_get(p_apb) == NRF_DOMAIN_GLOBAL ?
                        p_path->dppi_channel :
                        p_path->local_dppi_channel;
    NRFX_ASSERT(p_apb);
    // The endpoint must belong to one of used APB in existing connection.
    if ((p_path->p_dst_apb != p_apb) && (p_path->p_src_apb != p_apb))
    {
        if (!is_main_connection_needed(p_path->p_src_apb, p_path->p_dst_apb) ||
            p_apb != interconnect_apb_main_get())
            {
                NRFX_ASSERT(false);
            }
    }
    NRF_DPPI_ENDPOINT_SETUP(fork_tep, dppi_chan);
}

void nrfx_gppiv1_fork_endpoint_clear(uint8_t channel, uint32_t fork_tep)
{
    NRFX_ASSERT(fork_tep && nrfx_flag32_is_allocated(m_virtual_channels, channel));
    interconnect_apb_t const * p_apb = interconnect_apb_get(fork_tep);
    nrfx_gppi_channels_path_t * p_path = &channels_path[channel];

    NRFX_ASSERT(p_apb);
    // The endpoint must belong to one of used APB in existing connection.
    if ((p_path->p_dst_apb != p_apb) && (p_path->p_src_apb != p_apb))
    {
        if (!is_main_connection_needed(p_path->p_src_apb, p_path->p_dst_apb) ||
            p_apb != interconnect_apb_main_get())
            {
                NRFX_ASSERT(false);
            }
    }
    NRF_DPPI_ENDPOINT_CLEAR(fork_tep);
}

void nrfx_gppiv1_channel_endpoints_setup(uint8_t channel, uint32_t eep, uint32_t tep)
{
    NRFX_ASSERT(tep && eep);

    int err_code;
    interconnect_apb_t const * p_src_apb = (interconnect_apb_get(eep));
    interconnect_apb_t const * p_dst_apb = (interconnect_apb_get(tep));
    nrfx_gppi_channels_path_t * p_path = &channels_path[channel];

    NRFX_ASSERT(p_src_apb && p_dst_apb);

    uint8_t * src_dppi_chan = interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN_GLOBAL ?
                              &p_path->dppi_channel :
                              &p_path->local_dppi_channel;
    uint8_t * dst_dppi_chan = interconnect_apb_domain_get(p_dst_apb) == NRF_DOMAIN_GLOBAL ?
                              &p_path->dppi_channel :
                              &p_path->local_dppi_channel;

    if (interconnect_apb_domain_get(p_src_apb) == interconnect_apb_domain_get(p_dst_apb))
    {
        /* Endpoints belongs to the same domain - one local connection needed. */
        NRFX_ASSERT(src_dppi_chan == dst_dppi_chan);
        err_code = local_connection_create(p_src_apb, p_dst_apb, src_dppi_chan);
        if (err_code != 0)
        {
            NRFX_ASSERT(false);
            (void)local_connection_remove(p_src_apb, p_dst_apb, *src_dppi_chan);
        }
    }
    else
    {
        /* Endpoints in different domains - two local connections and one IPCT connection needed. */
        interconnect_ipct_t const * p_src_ipct = interconnect_ipct_get(p_src_apb);
        interconnect_ipct_t const * p_dst_ipct = interconnect_ipct_get(p_dst_apb);
        interconnect_apb_t const * p_src_ipct_apb =
                                        (interconnect_apb_get((uint32_t)p_src_ipct->p_ipct));
        interconnect_apb_t const * p_dst_ipct_apb =
                                        (interconnect_apb_get((uint32_t)p_dst_ipct->p_ipct));
        NRFX_ASSERT(src_dppi_chan != dst_dppi_chan);

        /* Creating local connection from source to IPCT peripheral inside the first domain. */
        err_code = local_connection_create(p_src_apb, p_src_ipct_apb, src_dppi_chan);
        NRFX_ASSERT(err_code == 0);
        if (err_code == 0)
        {
            /* Creating local connection from IPCT peripheral to destination inside the second domain. */
            err_code = local_connection_create(p_dst_ipct_apb, p_dst_apb, dst_dppi_chan);
            NRFX_ASSERT(err_code == 0);
            if (err_code == 0)
            {
                /* Creating IPCT connection between the first and the second domain. */
                err_code = ipct_connection_create(p_src_ipct, p_dst_ipct, p_path);
                NRFX_ASSERT(err_code == 0);
            }
        }
        if (err_code != 0)
        {
            (void)local_connection_remove(p_src_apb, p_src_ipct_apb, *src_dppi_chan);
            (void)local_connection_remove(p_dst_ipct_apb, p_dst_apb, *dst_dppi_chan);
            (void)ipct_connection_remove(p_src_ipct, p_dst_ipct, p_path);
        }
    }

    if (err_code == 0)
    {
        p_path->p_src_apb = p_src_apb;
        p_path->p_dst_apb = p_dst_apb;
        NRF_DPPI_ENDPOINT_SETUP(eep, *src_dppi_chan);
        NRF_DPPI_ENDPOINT_SETUP(tep, *dst_dppi_chan);
    }
    else
    {
        path_cleanup(p_path);
    }
}

void nrfx_gppiv1_channel_endpoints_clear(uint8_t channel, uint32_t eep, uint32_t tep)
{
    NRFX_ASSERT(tep && eep);

    int err_code;
    interconnect_apb_t const * p_src_apb = (interconnect_apb_get(eep));
    interconnect_apb_t const * p_dst_apb = (interconnect_apb_get(tep));
    nrfx_gppi_channels_path_t * p_path = &channels_path[channel];
    uint8_t * src_dppi_chan = interconnect_apb_domain_get(p_src_apb) == NRF_DOMAIN_GLOBAL ?
                              &p_path->dppi_channel :
                              &p_path->local_dppi_channel;
    uint8_t * dst_dppi_chan = interconnect_apb_domain_get(p_dst_apb) == NRF_DOMAIN_GLOBAL ?
                              &p_path->dppi_channel :
                              &p_path->local_dppi_channel;

