andyshinn/nRF54_Arduino/cores/nRF5/nordic/nrfx/helpers/internal/nrfx_gppiv1_ipct.c
    NRFX_ASSERT(p_src_apb && p_dst_apb && (p_path->p_src_apb == p_src_apb) &&
                (p_path->p_dst_apb == p_dst_apb));

    if (interconnect_apb_domain_get(p_src_apb) == interconnect_apb_domain_get(p_dst_apb))
    {
        /* Endpoints belongs to the same domain - need to remove one local connection. */
        NRFX_ASSERT(src_dppi_chan == dst_dppi_chan);
        err_code = local_connection_remove(p_src_apb, p_dst_apb, *src_dppi_chan);
        NRFX_ASSERT(err_code == 0);
    }
    else
    {
        /* Endpoints in different domains - need to remove two local connections and one IPCT connection. */
        NRFX_ASSERT(src_dppi_chan != dst_dppi_chan);
        interconnect_ipct_t const * p_src_ipct = interconnect_ipct_get(p_src_apb);
        interconnect_ipct_t const * p_dst_ipct = interconnect_ipct_get(p_dst_apb);
        interconnect_apb_t const * p_src_ipct_apb =
                                        interconnect_apb_get((uint32_t)p_src_ipct->p_ipct);
        interconnect_apb_t const * p_dst_ipct_apb =
                                        interconnect_apb_get((uint32_t)p_dst_ipct->p_ipct);

        /* Removing IPCT connection between the first and the second domain. */
        err_code = ipct_connection_remove(p_src_ipct, p_dst_ipct, p_path);
        NRFX_ASSERT(err_code == 0);
        if (err_code == 0)
        {
            /* Removing local connection from IPCT peripheral to destination inside the first domain. */
            err_code = local_connection_remove(p_src_apb, p_src_ipct_apb, *src_dppi_chan);
            NRFX_ASSERT(err_code == 0);
            if (err_code == 0)
            {
                /* Removing local connection from IPCT peripheral to destination inside the second domain. */
                err_code = local_connection_remove(p_dst_ipct_apb, p_dst_apb, *dst_dppi_chan);
                NRFX_ASSERT(err_code == 0);
            }
        }
    }
    if (err_code == 0)
    {
        path_cleanup(p_path);
        NRF_DPPI_ENDPOINT_CLEAR(eep);
        NRF_DPPI_ENDPOINT_CLEAR(tep);
    }
    NRFX_ASSERT(err_code == 0);
}

int nrfx_gppiv1_channel_free(uint8_t channel)
{
    int err;
    nrfx_gppi_channels_path_t * p_path;

    err = nrfx_flag32_free(&m_virtual_channels, channel);
    if (err < 0)
    {
        return err;
    }
    p_path = &channels_path[channel];
    path_cleanup(p_path);
    return 0;
}

bool nrfx_gppiv1_channel_check(uint8_t channel)
{
    interconnect_apb_t const * p_src_apb = channels_path[channel].p_src_apb;
    interconnect_apb_t const * p_dst_apb = channels_path[channel].p_dst_apb;
    uint8_t dppi_channel = channels_path[channel].dppi_channel;

    NRFX_ASSERT(nrfx_flag32_is_allocated(m_virtual_channels, channel));
    if (dppi_channel != CHANNEL_INVALID)
    {
        NRFX_ASSERT(p_src_apb && p_dst_apb);
        if (!nrf_dppi_channel_check(p_src_apb->p_dppi, dppi_channel) ||
            !nrf_dppi_channel_check(p_dst_apb->p_dppi, dppi_channel))
        {
            /* At least one of DPPIC channels is not valid. */
            return false;
        }
        if (is_main_connection_needed(p_src_apb, p_dst_apb) &&
            !nrf_dppi_channel_check(interconnect_apb_main_get()->p_dppi, dppi_channel))
        {
            /* DPPIC channel for main APB is not valid. */
            return false;
        }
        return true;
    }
    return false;
}

void nrfx_gppiv1_channels_disable_all(void)
{
    uint32_t mask = ~(uint32_t)m_virtual_channels;
    while (mask)
    {
        uint8_t chan = (uint8_t)NRF_CTZ(mask);
        dppic_channel_set(chan, false);
        mask &= ~NRFX_BIT(chan);
    }
}

void nrfx_gppiv1_channels_enable(uint32_t mask)
{
    while (mask)
    {
        uint8_t chan = (uint8_t)NRF_CTZ(mask);
        dppic_channel_set(chan, true);
        mask &= ~NRFX_BIT(chan);
    }
}

void nrfx_gppiv1_channels_disable(uint32_t mask)
{
    // Remove all connections for all channels determined by mask.
    while (mask)
    {
        // Remove assigned channels for all involved DPPICn peripherals.
        uint8_t chan = (uint8_t)NRF_CTZ(mask);
        dppic_channel_set(chan, false);
        mask &= ~NRFX_BIT(chan);
    }
}

#endif // NRFX_CHECK(NRFX_IPCT_ENABLED)
